# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
assign_type: DynamicATSS
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, EIEStemdsm_mutiv2, [64, 128]]  # 0-P2/4
  - [-1, 6, Dynamic_HGBlock, [48, 128, 3]]  # stage 1 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8  2
  - [-1, 6, Dynamic_HGBlock, [96, 512, 3]]   # stage 2 3

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P3/ 16
  - [-1, 6, Dynamic_HGBlock, [192, 1024, 1, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, Dynamic_HGBlock, [192, 1024, 1, True, True]]
  - [-1, 6, Dynamic_HGBlock, [192, 1024, 1, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, Dynamic_HGBlock, [384, 2048, 1, True, False]]  # stage 4
  - [-1, 1, SPPF, [1024, 5]]  # 10
  - [-1, 1, PSA, [1024]] # 11

head:
  - [-1, 1, ChannelAttention_HSFPN, []] # 12
  - [-1, 1, nn.Conv2d, [256, 1]] # 13
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 14

  - [7, 1, ChannelAttention_HSFPN, []] # 15
  - [-1, 1, nn.Conv2d, [256, 1]] # 16
  - [14, 1, ChannelAttention_HSFPN, [4, False]] # 17
  - [[-1, -2], 1, Multiply, []] # 18
  - [[-1, 14], 1, Add, []] # 19
  - [-1, 3, C2f_DCMB_KAN, [256]] # 20 P4/16

  - [14, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 21
  - [3, 1, ChannelAttention_HSFPN, []] # 22
  - [-1, 1, nn.Conv2d, [256, 1]] # 23
  - [21, 1, ChannelAttention_HSFPN, [4, False]] # 24
  - [[-1, -2], 1, Multiply, []] # 25
  - [[-1, 21], 1, Add, []] # 26
  - [-1, 3, C2f_DCMB_KAN, [256]] # 27 P3/8

  - [-1, 1, nn.Conv2d, [256, 3, 2, 1]] # 28
  - [20, 1, ChannelAttention_HSFPN, []] # 29
  - [-1, 1, nn.Conv2d, [256, 1]] # 30
  - [28, 1, ChannelAttention_HSFPN, [4, False]] # 31
  - [[-1, -2], 1, Multiply, []] # 32
  - [[-1, 28], 1, Add, []] # 33
  - [-1, 3, C2f_DCMB_KAN, [256]] # 34 P4/16

  - [28, 1, nn.Conv2d, [256, 3, 2, 1]] # 35
  - [13, 1, ChannelAttention_HSFPN, []] # 36
  - [-1, 1, nn.Conv2d, [256, 1]] # 37
  - [35, 1, ChannelAttention_HSFPN, [4, False]] # 38
  - [[-1, -2], 1, Multiply, []] # 39
  - [[-1, 35], 1, Add, []] # 40
  - [-1, 3, C2f_DCMB_KAN, [256]] # 41 P5/32

  - [[27, 34, 41], 1, Detect_LSDECD, [nc,256]] # RTDETRDecoder(P3, P4, P5)
